export type MenuItem = {
  name: string;
  price: string;
  desc?: string;
};

export const CATEGORY_DESCRIPTIONS: Record<string, string> = {
  'Пица с Бига':
    'Неаполитанска пица с БИГА. Процес на предварително дълго втасване, придава на пицата по-богат вкус, по-добра структура и по-голяма шупливост. Също така подобрява вкуса, аромата, текстурата и усвояването на печивата от организма. Опитайте и станете част от нашето БИГА семейство.',
  'Римска пица на парче':
    'Произведена чрез дълго втасване и смесване на различни сортове италиански брашна, замесени с процес на висока хидратация. Или по семпло казано — страшна вкусотия.',
};

export const MENU_DATA: Record<string, MenuItem[]> = {
  'Пица с Бига': [
    {
      name: 'Пица Маргарита',
      price: '16,10 лв. | 8,23 €',
      desc: 'Доматен сос, моцарела фиор ди лате, босилек, зехтин',
    },
    {
      name: 'Пица Калабрезе',
      price: '20,89 лв. | 10,68 €',
      desc: 'Доматен сос, моцарела фиор ди лате, пикантен салам, босилек, зехтин',
    },
    {
      name: 'Пица Прошуто Кото',
      price: '19,70 лв. | 10,07 €',
      desc: 'Доматен сос, моцарела фиор ди лате, прошуто кото, босилек, зехтин',
    },
    {
      name: 'Пица Прошуто Крудо',
      price: '22,08 лв. | 11,29 €',
      desc: 'Доматен сос, моцарела фиор ди лате, прошуто крудо, босилек, зехтин',
    },
    {
      name: 'Пица Четири сирена',
      price: '19,70 лв. | 10,07 €',
      desc: 'Сметана, моцарела фиор ди лате, скаморца, горгонзола, пармезан, зехтин',
    },
    {
      name: 'Пица Гъба Манатарка и наденица',
      price: '23,29 лв. | 11,91 €',
      desc: 'Доматен сос, моцарела фиор ди лате, манатарки, наденица, босилек, зехтин',
    },
    {
      name: 'Пица Мортадела и шам фъстък',
      price: '22,08 лв. | 11,29 €',
      desc: 'Сметана, моцарела фиор ди лате, мортадела, песто от шам фъстък, зехтин',
    },
    {
      name: 'Пица Фриариели и наденица',
      price: '22,08 лв. | 11,29 €',
      desc: 'Сметана, моцарела фиор ди лате, фриариели, наденица, босилек, зехтин',
    },
  ],
  'Римска пица на парче': [
    { name: 'Маргарита', price: '7,10 лв. | 3,63 €' },
    { name: 'Прошуто Кото', price: '8,29 лв. | 4,24 €' },
    { name: 'Спианата люта', price: '8,90 лв. | 4,55 €' },
  ],
  'Фокача': [{ name: 'Фокача', price: '14,69 лв. | 7,51 €', desc: '700 гр.' }],
  'Напитки': [
    { name: 'Кола', price: '4,69 лв. | 2,40 €', desc: '330 ml' },
    { name: 'Минерална вода', price: '3,91 лв. | 2,00 €', desc: '500 ml' },
    { name: 'Бира Tambone', price: '13,69 лв. | 7,00 €' },
  ],
};
